[Arabic]
1000 = بحث نشط
1001 = أو انقر مرة واحدة متصلة
1002 = استخدم اتصال "Bluetooth" على جهاز iPhone الخاص بك
1003 = يرجى تشغيل "البلوتوث" على هاتفك
1004 = البحث ...
1005 = أكمل البحث
1006 = إلغاء
1007 = في انتظار الاتصال ...
1008 = أو اتصال USB
1009 = انقر للاتصال
ربط = 1010
1011=Connect Fail...
1012=Delete
1013=Connect your Huawei phone with USB
1014=Updating... DO NOT power off
1015=Update success
1016=Update failed
1017=Reboot
1018=Need to complete activation
1019=Hardware fail
ربط = 1020
[-Arabic-]
